newdynxsty/aifitnessmirror/Repetition_Count_Model_WIP/en-us--M55M1_Series_BSP_CMSIS_V3.01.002/SampleCode/MachineLearning/PoseLandmark_YOLOv8n_workout_w_accel/main.cpp
/**************************************************************************//**
 * @file     main.cpp
 * @version  V1.00
 * @brief    Pose landmark network sample. Demonstrate pose landmark detect.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#include "BoardInit.hpp"      /* Board initialisation */
#include "log_macros.h"      /* Logging macros (optional) */

#include "BufAttributes.hpp" /* Buffer attributes to be applied */
#include "YOLOv8nPoseModel.hpp"       /* Model API */
#include "YOLOv8nPosePostProcessing.hpp"

// --- NEW REP COUNTER ---
#include "RepCounterModel.hpp" // MUST duplicate ExerciseClassifierModel.hpp/cpp and rename to RepCounterModel

#include "imlib.h"          /* Image processing */
#include "framebuffer.h"
#include "ModelFileReader.h"
#include "ff.h"
#include <math.h>

#undef PI /* PI macro conflict with CMSIS/DSP */
#include "NuMicro.h"

//#define __PROFILE__
#define __USE_DISPLAY__
//#define __USE_UVC__

#include "Profiler.hpp"
#include "ImageSensor.h"

#if defined (__USE_DISPLAY__)
    #include "Display.h"
#endif

#if defined (__USE_UVC__)
    #include "UVC.h"
#endif

#define NUM_FRAMEBUF 2  //1 or 2

#define YOLO_MODEL_AT_HYPERRAM_ADDR     (0x82400000)
#define YOLO_MODEL_FILE                "0:\\YOLOv8n-pose.tflite"

// --- NEW REP COUNTER ---
#define REP_COUNTER_MODEL_FILE         "0:\\rep_counter_int8_vela.tflite"

#define POSE_PRESENCE_THRESHOLD  				(0.7)
#define POSE_KEYPOINT_VISIBLE_THRESHOLD  		(0.5)

// Text Layout Configuration (Right Sidebar)
#define TEXT_X_OFFSET  (320 * IMAGE_DISP_UPSCALE_FACTOR + 10) 
#define TEXT_Y_START   20  // The vertical starting position for the first line
#define LINE_HEIGHT    (FONT_HTIGHT * FONT_DISP_UPSCALE_FACTOR) // Height of one line of text

// Calculate subsequent Y positions automatically
#define TEXT_Y_PRED    (TEXT_Y_START)
#define TEXT_Y_REPS    (TEXT_Y_START + LINE_HEIGHT)
#define TEXT_Y_FPS     (TEXT_Y_START + (2 * LINE_HEIGHT))
#define TEXT_Y_AX    (TEXT_Y_START + (3 * LINE_HEIGHT))
#define TEXT_Y_AY    (TEXT_Y_START + (4 * LINE_HEIGHT))
#define TEXT_Y_AZ    (TEXT_Y_START + (5 * LINE_HEIGHT))
#define TEXT_Y_HR    (TEXT_Y_START + (6 * LINE_HEIGHT))

int timepassed = 0;

// UART1 Bluetooth Buffers
#define RX_BUF_SIZE 128
extern "C" {
    volatile uint8_t g_u8RecData[RX_BUF_SIZE];
    volatile uint32_t g_u32DataIdx = 0;
    volatile bool g_bMsgReceived = false;

    // The IRQ Handler must be extern "C"
    void UART1_IRQHandler(void) {
        uint32_t u32IntSts = UART1->INTSTS;
        if (u32IntSts & UART_INTSTS_RDAINT_Msk) {
            while (!UART_GET_RX_EMPTY(UART1)) {
                uint8_t u8Char = UART_READ(UART1);
                if (g_u32DataIdx < (RX_BUF_SIZE - 1)) {
                    g_u8RecData[g_u32DataIdx++] = u8Char;
                    if (u8Char == '\n' || u8Char == '\r') {
                        g_u8RecData[g_u32DataIdx] = '\0';
                        g_bMsgReceived = true;
                    }
                } else {
                    g_u32DataIdx = 0; // Overflow protection
                }
            }
        }
        if (u32IntSts & (UART_INTSTS_RLSINT_Msk | UART_INTSTS_BUFERRINT_Msk)) {
            UART_ClearIntFlag(UART1, (UART_INTSTS_RLSINT_Msk | UART_INTSTS_BUFERRINT_Msk));
        }
    }
}

static constexpr int KP_WIN = 16;
static constexpr int KP_DIM = 51;



// --- NEW REP COUNTER STATE MACHINE GLOBALS ---
static int g_repCount = 0;
static bool g_isInBottomPose = false;

static inline int8_t QuantizeToInt8(float x, float scale, int32_t zeroPoint)
{
    int32_t v = (int32_t)lrintf(x / scale) + zeroPoint;
    if (v < -128) v = -128;
    if (v > 127)  v = 127;
    return (int8_t)v;
}



enum{
	ePOSE_KP_INDEX_NOSE,				//0
	ePOSE_KP_INDEX_LEFT_EYE,			//1
	ePOSE_KP_INDEX_RIGHT_EYE,			//2
	ePOSE_KP_INDEX_LEFT_EAR,			//3
	ePOSE_KP_INDEX_RIGHT_EAR,			//4
	ePOSE_KP_INDEX_LEFT_SHOULDER,		//5
	ePOSE_KP_INDEX_RIGHT_SHOULDER,		//6
	ePOSE_KP_INDEX_LEFT_ELBOW,			//7
	ePOSE_KP_INDEX_RIGHT_ELBOW,			//8
	ePOSE_KP_INDEX_LEFT_WRIST,			//9
	ePOSE_KP_INDEX_RIGHT_WRIST,			//10
	ePOSE_KP_INDEX_LEFT_HIP,			//11
	ePOSE_KP_INDEX_RIGHT_HIP,			//12
	ePOSE_KP_INDEX_LEFT_KNEE,			//13
	ePOSE_KP_INDEX_RIGHT_KNEE,			//14
	ePOSE_KP_INDEX_LEFT_ANKLE,			//15
	ePOSE_KP_INDEX_RIGHT_ANKLE,			//16
	ePOSE_KP_NUMS,						//17
}E_POSE_KP_INDEX;


typedef enum
{
    eFRAMEBUF_EMPTY,
    eFRAMEBUF_FULL,
    eFRAMEBUF_INF
} E_FRAMEBUF_STATE;

typedef struct
{
    E_FRAMEBUF_STATE eState;
    image_t frameImage;
    std::vector<arm::app::yolov8n_pose::PoseResult> results;
} S_FRAMEBUF;


S_FRAMEBUF s_asFramebuf[NUM_FRAMEBUF];

namespace arm
{
namespace app
{
/* Tensor arena buffer */
static uint8_t tensorArena[ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;


// --- NEW REP COUNTER --- Memory Arena Allocation
static uint8_t repCounterTensorArena[256 * 1024] ACTIVATION_BUF_ATTRIBUTE; 
	
} /* namespace app */
} /* namespace arm */

//frame buffer managemnet function
static S_FRAMEBUF *get_empty_framebuf()
{
    int i;
    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_EMPTY)
            return &s_asFramebuf[i];
    }
    return NULL;
}

static S_FRAMEBUF *get_full_framebuf()
{
    int i;
    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_FULL)
            return &s_asFramebuf[i];
    }
    return NULL;
}

static S_FRAMEBUF *get_inf_framebuf()
{
    int i;
    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_INF)
            return &s_asFramebuf[i];
    }
    return NULL;
}

#define IMAGE_DISP_UPSCALE_FACTOR 2
#if defined(LT7381_LCD_PANEL)
#define FONT_DISP_UPSCALE_FACTOR 2
#else
#define FONT_DISP_UPSCALE_FACTOR 1
#endif

#if defined(__USE_UVC__)
#define GLCD_WIDTH	320
#define GLCD_HEIGHT	240
#else
#define GLCD_WIDTH	320 
#define GLCD_HEIGHT	240 
#endif

