newdynxsty/aifitnessmirror/Repetition_Count_Model_WIP/en-us--M55M1_Series_BSP_CMSIS_V3.01.002/SampleCode/MachineLearning/PoseLandmark_YOLOv8n_workout_w_accel/main.cpp
void Display_PutText_Wrapped(const char* text, int x, int y, uint16_t color, uint16_t bg, int scale) {
    int screenWidth = 800; 
    int charWidth = 8 * scale;   // Standard font is 8 pixels wide
    int charHeight = 16 * scale; // Standard font is 16 pixels tall
    
    int currentX = x;
    int currentY = y;
    
    for (int i = 0; i < strlen(text); i++) {
        if (currentX + charWidth > screenWidth) {
            currentX = x;             
            currentY += charHeight;   
        }
        Display_PutText(&text[i], 1, currentX, currentY, color, bg, false, scale);
        currentX += charWidth;
    }
}
#define IMAGE_FB_SIZE	(GLCD_WIDTH * GLCD_HEIGHT * 2)

#undef OMV_FB_SIZE
#define OMV_FB_SIZE (IMAGE_FB_SIZE + 1024)

#undef OMV_FB_ALLOC_SIZE
#define OMV_FB_ALLOC_SIZE	(1*1024)

__attribute__((section(".bss.vram.data"), aligned(32))) static char fb_array[OMV_FB_SIZE + OMV_FB_ALLOC_SIZE];
__attribute__((section(".bss.vram.data"), aligned(32))) static char jpeg_array[OMV_JPEG_BUF_SIZE];

#if (NUM_FRAMEBUF == 2)
    __attribute__((section(".bss.vram.data"), aligned(32))) static char frame_buf1[OMV_FB_SIZE];
#endif

char *_fb_base = NULL;
char *_fb_end = NULL;
char *_jpeg_buf = NULL;
char *_fballoc = NULL;

static void omv_init()
{
    image_t frameBuffer;
    int i;

    frameBuffer.w = GLCD_WIDTH;
    frameBuffer.h = GLCD_HEIGHT;
    frameBuffer.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    frameBuffer.pixfmt = PIXFORMAT_RGB565;

    _fb_base = fb_array;
    _fb_end =  fb_array + OMV_FB_SIZE - 1;
    _fballoc = _fb_base + OMV_FB_SIZE + OMV_FB_ALLOC_SIZE;
    _jpeg_buf = jpeg_array;

    fb_alloc_init0();

    framebuffer_init0();
    framebuffer_init_from_image(&frameBuffer);

    for (i = 0 ; i < NUM_FRAMEBUF; i++)
    {
        s_asFramebuf[i].eState = eFRAMEBUF_EMPTY;
    }

    framebuffer_init_image(&s_asFramebuf[0].frameImage);

#if (NUM_FRAMEBUF == 2)
    s_asFramebuf[1].frameImage.w = GLCD_WIDTH;
    s_asFramebuf[1].frameImage.h = GLCD_HEIGHT;
    s_asFramebuf[1].frameImage.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    s_asFramebuf[1].frameImage.pixfmt = PIXFORMAT_RGB565;
    s_asFramebuf[1].frameImage.data = (uint8_t *)frame_buf1;
#endif
}

static void DrawPoseLandmark(
    const std::vector<arm::app::yolov8n_pose::PoseResult> &results,
    image_t *drawImg
)
{
	arm::app::yolov8n_pose::PoseResult pose;
	int lineColor = COLOR_R5_G6_B5_TO_RGB565(0,COLOR_G6_MAX, 0);	
	int poseSize = results.size();
	
	for(int p = 0; p < poseSize; p ++)
	{
		pose = results[p];
		imlib_draw_rectangle(drawImg, pose.m_poseBox.x, pose.m_poseBox.y, pose.m_poseBox.w, pose.m_poseBox.h, COLOR_B5_MAX, 2, false);

		struct S_KEY_POINT keyPoint;
		struct S_KEY_POINT keyPointTemp;
		std::vector<struct S_KEY_POINT> keyPoints = pose.m_keyPoints;

		for(int k = 0; k < keyPoints.size(); k ++)
		{
			keyPoint = keyPoints[k];
			if(keyPoint.visible < POSE_KEYPOINT_VISIBLE_THRESHOLD)
				continue;

			imlib_draw_circle(drawImg, keyPoint.x, keyPoint.y, 1, COLOR_B5_MAX, 1, true);

			if( k == ePOSE_KP_INDEX_NOSE || k == ePOSE_KP_INDEX_LEFT_SHOULDER) {}
			else if(k == ePOSE_KP_INDEX_LEFT_EYE || k == ePOSE_KP_INDEX_RIGHT_EYE) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_NOSE];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}
			else if(k == ePOSE_KP_INDEX_LEFT_EAR) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_LEFT_EYE];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}
			else if(k == ePOSE_KP_INDEX_RIGHT_EAR) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_RIGHT_EYE];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}
			else if(k == ePOSE_KP_INDEX_RIGHT_SHOULDER) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_LEFT_SHOULDER];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}
			else if(k == ePOSE_KP_INDEX_LEFT_ELBOW) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_LEFT_SHOULDER];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}
			else if(k == ePOSE_KP_INDEX_RIGHT_ELBOW) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_RIGHT_SHOULDER];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}
			else if(k == ePOSE_KP_INDEX_LEFT_WRIST) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_LEFT_ELBOW];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}
			else if(k == ePOSE_KP_INDEX_RIGHT_WRIST) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_RIGHT_ELBOW];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}
			else if(k == ePOSE_KP_INDEX_LEFT_HIP) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_LEFT_SHOULDER];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}			
			else if(k == ePOSE_KP_INDEX_RIGHT_HIP) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_RIGHT_SHOULDER];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_LEFT_HIP];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}
			else if(k == ePOSE_KP_INDEX_LEFT_KNEE) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_LEFT_HIP];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}						
			else if(k == ePOSE_KP_INDEX_RIGHT_KNEE) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_RIGHT_HIP];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}			
			else if(k == ePOSE_KP_INDEX_LEFT_ANKLE) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_LEFT_KNEE];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}						
			else if(k == ePOSE_KP_INDEX_RIGHT_ANKLE) {
				keyPointTemp = keyPoints[ePOSE_KP_INDEX_RIGHT_KNEE];
				if(keyPointTemp.visible >=  POSE_KEYPOINT_VISIBLE_THRESHOLD)
					imlib_draw_line(drawImg, keyPoint.x, keyPoint.y, keyPointTemp.x, keyPointTemp.y, lineColor, 1);
			}						
		}
	}
}

static int32_t PrepareModelToHyperRAM(const char* modelFile, uint32_t dstAddr)
{
#define EACH_READ_SIZE 512

    TCHAR sd_path[] = { '0', ':', 0 };
    f_chdrive(sd_path);

    int32_t i32FileSize;
    int32_t i32FileReadIndex = 0;
    int32_t i32Read;

    if (!ModelFileReader_Initialize(modelFile))
    {
        printf_err("Unable open model %s\n", modelFile);
        return -1;
    }

    i32FileSize = ModelFileReader_FileSize();
    info("Model file size %i \n", i32FileSize);

