newdynxsty/aifitnessmirror/Repetition_Count_Model_WIP/en-us--M55M1_Series_BSP_CMSIS_V3.01.002/SampleCode/MachineLearning/PoseLandmark_YOLOv8n_workout_w_accel/main.cpp
    while (i32FileReadIndex < i32FileSize)
    {
        i32Read = ModelFileReader_ReadData((BYTE *)(dstAddr + i32FileReadIndex), EACH_READ_SIZE);
        if (i32Read < 0)
            break;
        i32FileReadIndex += i32Read;
    }

    ModelFileReader_Finish();

    if (i32FileReadIndex < i32FileSize)
    {
        printf_err("Read model file size is not enough\n");
        return -2;
    }

    return i32FileSize;
}

int main()
{
    /* Initialise the UART module to allow printf related functions (if using retarget) */
    BoardInit();
	SYS_UnlockReg();
	/* UART1 (Bluetooth) Clock & Pins */
	CLK_SetModuleClock(UART1_MODULE, CLK_UARTSEL0_UART1SEL_HIRC, CLK_UARTDIV0_UART1DIV(1));
	CLK_EnableModuleClock(UART1_MODULE);
	SET_UART1_RXD_PA2();
	SET_UART1_TXD_PA3();

	/* UART1 Hardware Init */
	SYS_ResetModule(SYS_UART1RST);
	UART_Open(UART1, 9600);
	UART_EnableInt(UART1, UART_INTEN_RDAIEN_Msk);
	NVIC_EnableIRQ(UART1_IRQn);
	SYS_LockReg();
			
	/* Copy model file from SD to HyperRAM*/		
	int32_t yoloModelSize = PrepareModelToHyperRAM(YOLO_MODEL_FILE, YOLO_MODEL_AT_HYPERRAM_ADDR);
	if (yoloModelSize <= 0)
	{
			printf_err("Failed to prepare YOLO model\n");
			return 1;
	}

    // --- NEW REP COUNTER --- Compute Address and Load Model
    uint32_t repCounterModelAddr = YOLO_MODEL_AT_HYPERRAM_ADDR + ((yoloModelSize + 0xFFF) & ~0xFFF);
    int32_t repCounterModelSize = PrepareModelToHyperRAM(REP_COUNTER_MODEL_FILE, repCounterModelAddr);
    if (repCounterModelSize <= 0)
    {
            printf_err("Failed to prepare REP COUNTER model\n");
            return 1;
    }

	// --- Init YOLO model interpreter ---
	arm::app::YOLOv8nPoseModel poseModel;
	if (!poseModel.Init(arm::app::tensorArena,
						sizeof(arm::app::tensorArena),
						(unsigned char*)YOLO_MODEL_AT_HYPERRAM_ADDR,
						yoloModelSize))
	{
			printf_err("Failed to initialise YOLO model\n");
			return 1;
	}


    // --- NEW REP COUNTER --- Init Model Interpreter
    arm::app::RepCounterModel repCounterModel;
    if (!repCounterModel.Init(arm::app::repCounterTensorArena,
                              sizeof(arm::app::repCounterTensorArena),
                              (unsigned char*)repCounterModelAddr,
                              repCounterModelSize))
    {
            printf_err("Failed to initialise REP COUNTER model\n");
            return 1;
    }

    /* Setup cache poicy of tensor arean buffer */
    info("Set tesnor arena cache policy to WTRA \n");
    const std::vector<ARM_MPU_Region_t> mpuConfig =
    {
        {
            ARM_MPU_RBAR(((unsigned int)arm::app::tensorArena), ARM_MPU_SH_NON, 0, 1, 1),
            ARM_MPU_RLAR((((unsigned int)arm::app::tensorArena) + ACTIVATION_BUF_SZ - 1), eMPU_ATTR_CACHEABLE_WTRA)
        },

        // --- NEW REP COUNTER --- MPU Configuration
        {
            ARM_MPU_RBAR(((unsigned int)arm::app::repCounterTensorArena), ARM_MPU_SH_NON, 0, 1, 1),
            ARM_MPU_RLAR((((unsigned int)arm::app::repCounterTensorArena) + sizeof(arm::app::repCounterTensorArena) - 1), eMPU_ATTR_CACHEABLE_WTRA)
        },
        {
            ARM_MPU_RBAR(((unsigned int)fb_array), ARM_MPU_SH_NON, 0, 1, 1),
            ARM_MPU_RLAR((((unsigned int)fb_array) + OMV_FB_SIZE - 1), eMPU_ATTR_NON_CACHEABLE)
        },
#if (NUM_FRAMEBUF == 2)
        {
            ARM_MPU_RBAR(((unsigned int)frame_buf1), ARM_MPU_SH_NON, 0, 1, 1),
            ARM_MPU_RLAR((((unsigned int)frame_buf1) + OMV_FB_SIZE - 1), eMPU_ATTR_NON_CACHEABLE)
        },
#endif
    };

    // Setup MPU configuration
    InitPreDefMPURegion(&mpuConfig[0], mpuConfig.size());

    TfLiteTensor *inputTensor   = poseModel.GetInputTensor(0);

    TfLiteIntArray *inputShape = poseModel.GetInputShape(0);
    const int inputImgCols = inputShape->data[arm::app::YOLOv8nPoseModel::ms_inputColsIdx];
    const int inputImgRows = inputShape->data[arm::app::YOLOv8nPoseModel::ms_inputRowsIdx];
    const uint32_t nChannels = inputShape->data[arm::app::YOLOv8nPoseModel::ms_inputChannelsIdx];

    arm::app::QuantParams inQuantParams = arm::app::GetTensorQuantParams(inputTensor);
		


    // --- NEW REP COUNTER --- Tensor Extractions
    TfLiteTensor* repInTensor = repCounterModel.GetInputTensor(0);
    TfLiteTensor* repOutTensor = repCounterModel.GetOutputTensor(0);
    arm::app::QuantParams repInQ = arm::app::GetTensorQuantParams(repInTensor);
    arm::app::QuantParams repOutQ = arm::app::GetTensorQuantParams(repOutTensor);

    // postProcess
	arm::app::yolov8n_pose::YOLOv8nPosePostProcessing postProcess(&poseModel, POSE_PRESENCE_THRESHOLD);
	
    //display framebuffer
    image_t frameBuffer;
    rectangle_t roi;

    //omv library init
    omv_init();
    framebuffer_init_image(&frameBuffer);

#ifndef __PROFILE__
    pmu_reset_counters();
#endif

#define EACH_PERF_SEC 1
    uint64_t u64PerfCycle;
    uint64_t u64PerfFrames = 0;

    u64PerfCycle = pmu_get_systick_Count();
    u64PerfCycle += (SystemCoreClock * EACH_PERF_SEC);

    S_FRAMEBUF *infFramebuf;
    S_FRAMEBUF *fullFramebuf;
    S_FRAMEBUF *emptyFramebuf;

    ImageSensor_Init();
    ImageSensor_Config(eIMAGE_FMT_RGB565, frameBuffer.w, frameBuffer.h, true);

#if defined (__USE_DISPLAY__)
    char szDisplayText[100];
    S_DISP_RECT sDispRect;
    Display_Init();
    Display_ClearLCD(C_WHITE);
#endif

#if defined (__USE_UVC__)
	UVC_Init();
    HSUSBD_Start();
#endif

    while (1)
    {
        emptyFramebuf = get_empty_framebuf();
        if (emptyFramebuf)
        {
            ImageSensor_TriggerCapture((uint32_t)(emptyFramebuf->frameImage.data));
		}
		
        fullFramebuf = get_full_framebuf();
        if (fullFramebuf)
        {
            image_t resizeImg;
            roi.x = 0; roi.y = 0; roi.w = fullFramebuf->frameImage.w; roi.h = fullFramebuf->frameImage.h;

            resizeImg.w = inputImgCols; resizeImg.h = inputImgRows;
            resizeImg.data = (uint8_t *)inputTensor->data.data;
            resizeImg.pixfmt = PIXFORMAT_RGB888;

            imlib_nvt_scale(&fullFramebuf->frameImage, &resizeImg, &roi);

			auto *req_data = static_cast<uint8_t *>(inputTensor->data.data);
			auto *signed_req_data = static_cast<int8_t *>(inputTensor->data.data);

			for (size_t i = 0; i < inputTensor->bytes; i++)
			{
				signed_req_data[i] = static_cast<int8_t>(req_data[i]) - 128;
			}

			poseModel.RunInference();
            fullFramebuf->eState = eFRAMEBUF_INF;
        }

        infFramebuf = get_inf_framebuf();
        if (infFramebuf)
        {
			postProcess.RunPostProcessing(
				inputImgCols, inputImgRows, infFramebuf->frameImage.w, infFramebuf->frameImage.h, infFramebuf->results);
					
			// ---- EXERCISE CLASSIFIER AND REP COUNTER ----

					  float current_pose_conf = 0.0f;
						float prob_standing = 0.0f;
						float prob_bottom = 0.0f;

            if (infFramebuf->results.size() > 0)
            {
                const auto& pose = infFramebuf->results[0];

