newdynxsty/aifitnessmirror/Repetition_Count_Model_WIP/en-us--M55M1_Series_BSP_CMSIS_V3.01.002/SampleCode/MachineLearning/PoseLandmark_YOLOv8n_workout_w_accel/main.cpp
                float feat[KP_DIM];
                int idx = 0;

                for (int k = 0; k < ePOSE_KP_NUMS; k++)
                {
                    const auto& kp = pose.m_keyPoints[k];
                    
                    // Normalize relative to the bounding box rather than the full screen
                    float box_w = (pose.m_poseBox.w > 0) ? (float)pose.m_poseBox.w : 1.0f;
                    float box_h = (pose.m_poseBox.h > 0) ? (float)pose.m_poseBox.h : 1.0f;

                    float xn = (float)(kp.x - pose.m_poseBox.x) / box_w;
                    float yn = (float)(kp.y - pose.m_poseBox.y) / box_h;
                    float cn = kp.visible;

                    feat[idx++] = xn;
                    feat[idx++] = yn;
                    feat[idx++] = cn;
                }



                // --- NEW REP COUNTER --- 
                int8_t* repIn = (int8_t*)repInTensor->data.data;
                for (int i = 0; i < KP_DIM; i++) {
                    repIn[i] = QuantizeToInt8(feat[i], repInQ.scale, repInQ.offset);
                }

                repCounterModel.RunInference();

                // Extract INT8 outputs and Dequantize (It's now a true percentage!)
                int8_t* repOut = (int8_t*)repOutTensor->data.data;

								prob_standing   = ((int)repOut[1] - repOutQ.offset) * repOutQ.scale / 2 * 10 + 0.125;
								prob_bottom = ((int)repOut[0] - repOutQ.offset) * repOutQ.scale / 7 * 10 - 0.05;

                // Pick the highest probability
                int current_pose_class = (prob_standing > prob_bottom) ? 1 : 0;
                current_pose_conf = (current_pose_class == 1) ? prob_standing : prob_bottom;

                // 3. State Machine Logic
                if (current_pose_conf >= 0.75f) {
                    if (current_pose_class == 0) {
                        g_isInBottomPose = true; 
                    } else if (current_pose_class == 1 && g_isInBottomPose) {
                        g_repCount++;            
                        g_isInBottomPose = false;	
                    }
                }
							}

            //draw bbox and render
			if(infFramebuf->results.size())
			{
				DrawPoseLandmark(infFramebuf->results, &infFramebuf->frameImage);
			}

            //display result image
#if defined (__USE_DISPLAY__)
            sDispRect.u32TopLeftX = 0;
            sDispRect.u32TopLeftY = 0;
			sDispRect.u32BottonRightX = ((frameBuffer.w * IMAGE_DISP_UPSCALE_FACTOR) - 1);
			sDispRect.u32BottonRightY = ((frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR) - 1);

            Display_FillRect((uint16_t *)infFramebuf->frameImage.data, &sDispRect, IMAGE_DISP_UPSCALE_FACTOR);
			
                    // --- NEW REP COUNTER --- Display Reps and current state
                    char repText[64];
                    const char* pose_name = g_isInBottomPose ? "DOWN" : "UP";
							snprintf(repText, sizeof(repText), "Reps: %d [%s] (stand: %f, bottom %f)", g_repCount, pose_name, prob_standing, prob_bottom);
                    Display_PutText_Wrapped(
                            repText,
                            650,
                            FONT_HTIGHT*2 + 100, // Placed slightly underneath the Exercise text
                            C_RED,
                            C_WHITE,
                            FONT_DISP_UPSCALE_FACTOR
                    );

            // Display accelerometer and heart rate data
            if (g_bMsgReceived) {
                    char localBuf[RX_BUF_SIZE];
                    NVIC_DisableIRQ(UART1_IRQn);
                    memcpy(localBuf, (const void*)g_u8RecData, g_u32DataIdx);
                    g_u32DataIdx = 0;
                    g_bMsgReceived = false;
                    NVIC_EnableIRQ(UART1_IRQn);

                    float bAx = 0, bAy = 0, bAz = 0;
                    char bHr[20] = {0};
                    
                    if (sscanf(localBuf, "A:%f,%f,%f|HR:%s", &bAx, &bAy, &bAz, bHr) >= 3) {
                            S_DISP_RECT sRect;
                            sRect.u32TopLeftX = TEXT_X_OFFSET;
                            sRect.u32BottonRightX = Disaplay_GetLCDWidth() - 1;
                            
                            sprintf(szDisplayText, "AX: %.2f", bAx);
                            sRect.u32TopLeftY = TEXT_Y_AX; sRect.u32BottonRightY = TEXT_Y_AX + LINE_HEIGHT - 1;
                            Display_ClearRect(C_WHITE, &sRect);
                            Display_PutText(szDisplayText, strlen(szDisplayText), TEXT_X_OFFSET, TEXT_Y_AX, C_BLACK, C_WHITE, false, FONT_DISP_UPSCALE_FACTOR);

                            sprintf(szDisplayText, "AY: %.2f", bAy);
                            sRect.u32TopLeftY = TEXT_Y_AY; sRect.u32BottonRightY = TEXT_Y_AY + LINE_HEIGHT - 1;
                            Display_ClearRect(C_WHITE, &sRect);
                            Display_PutText(szDisplayText, strlen(szDisplayText), TEXT_X_OFFSET, TEXT_Y_AY, C_BLACK, C_WHITE, false, FONT_DISP_UPSCALE_FACTOR);

                            sprintf(szDisplayText, "AZ: %.2f", bAz);
                            sRect.u32TopLeftY = TEXT_Y_AZ; sRect.u32BottonRightY = TEXT_Y_AZ + LINE_HEIGHT - 1;
                            Display_ClearRect(C_WHITE, &sRect);
                            Display_PutText(szDisplayText, strlen(szDisplayText), TEXT_X_OFFSET, TEXT_Y_AZ, C_BLACK, C_WHITE, false, FONT_DISP_UPSCALE_FACTOR);
                            
                            timepassed +=1;
                            sprintf(szDisplayText, "HR: %s", bHr);
                            sRect.u32TopLeftY = TEXT_Y_HR; sRect.u32BottonRightY = TEXT_Y_HR + LINE_HEIGHT - 1;
                            Display_ClearRect(C_WHITE, &sRect);
                            Display_PutText(szDisplayText, strlen(szDisplayText), TEXT_X_OFFSET, TEXT_Y_HR, (strcmp(bHr, "No") == 0 ? C_RED : C_MAGENTA), C_WHITE, false, FONT_DISP_UPSCALE_FACTOR);
                    }
            }
#endif

            u64PerfFrames ++;
			if ((uint64_t) pmu_get_systick_Count() > u64PerfCycle)
            {
#if defined (__USE_DISPLAY__)
				#define SCREEN_HEIGHT 240			
				uint32_t yOffset = (SCREEN_HEIGHT - (frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR)) / 2;
				sDispRect.u32TopLeftX = 0;																																																																																																													
				sDispRect.u32TopLeftY = frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR;
				sDispRect.u32BottonRightX = (frameBuffer.w);
				sDispRect.u32BottonRightY = ((frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR) + (FONT_DISP_UPSCALE_FACTOR * FONT_HTIGHT) - 1);

                Display_ClearRect(C_WHITE, &sDispRect);
                sprintf(szDisplayText, "Frame Rate %llu", u64PerfFrames / EACH_PERF_SEC);
                Display_PutText_Wrapped(
                        szDisplayText,
                        650,
                        0,
                        C_BLUE,
                        C_WHITE,
                        FONT_DISP_UPSCALE_FACTOR
                );
#endif
                u64PerfCycle = (uint64_t)pmu_get_systick_Count() + (uint64_t)(SystemCoreClock * EACH_PERF_SEC);
                u64PerfFrames = 0;
			}
            infFramebuf->eState = eFRAMEBUF_EMPTY;
		}

		if (emptyFramebuf)
		{
			ImageSensor_WaitCaptureDone();
            emptyFramebuf->eState = eFRAMEBUF_FULL;		
		}
    }
    return 0;
}